Using tput.org
#+FILETAGS: :vimwiki:

* Using tput
** Bash - using `tput`
# %toc

*** Color capabilities

**** `tput setab [1-7]` – Set a background color using ANSI escape
**** `tput setb [1-7]` – Set a background color
**** `tput setaf [1-7]` – Set a foreground color using ANSI escape
**** `tput setf [1-7]` – Set a foreground Color

*** Text capabilities
**** `tput bold` – Set bold mode
**** `tput dim` – turn on half-bright mode
**** `tput smul` – begin underline mode
**** `tput rmul` – exit underline mode
**** `tput rev` – Turn on reverse mode
**** `tput smso` – Enter standout mode (bold on rxvt)
**** `tput rmso` – Exit standout mode
**** `tput sgr0` – Turn off all attributes

*** Color codes
**** `0` – Black
**** `1` – Red
**** `2` – Green
**** `3` – Yellow
**** `4` – Blue
**** `5` – Magenta
**** `6` – Cyan
**** `7` – White
